//для одновим. масиву із n цілих елементів визначає суму його елементів, розташованих праворуч останього від'ємного елемента
//6   -8   15   9   -1   3   5   -10   12   2
#include <iostream>
#define n 20
using namespace std;
int main()
{
	int a[n], sum = 0, i, n1, iend, *pa;
	pa = &a[0];
	while (n1 == 0) //користувач вводить розмірність, відмінну від 0
	{
		cout << "Enter integer value doesn`t equal 0: ";
		cin >> n1;
	}
	int* arr = new int[n1]; // Виділяємо пам'ять для масиву
	cout << "Enter element: " << endl; // заповнюємо масив
	for (i = 0; i < n1; i++)
	{
		cout << "Element " << i + 1 << ": ";
		cin >> *(pa+i);
	}
	for (i = 0; i < n1; i++)//вывод
		cout << *(pa + i) << "\t";
	for (i = 0; i < n1; i++)
	{
		if (*(pa + i) < 0)//если элемент отрицательный, то присваиваем ему его номер
			iend = i;
	}
	for (i = iend + 1; i < n1; i++)//если номер элемента равен номеру последнего отрицательного числа +1. (т.е. следующий элемент)
		sum = sum + *(pa + i);//добавляем этот элемент к сумме
	cout << "Summ = " << sum;//выводим сумму
	return 0;
}